app/views/albums/new.html.erb

    <select name="album[band_id]">
      <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"