app/controllers/albums_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def new
    @band = Band.find(params[:band_id])

INSERT INTO "albums" ("title", "year", "band_id", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "dimba"], ["year", 282], ["band_id", 1], ["live", true], ["created_at", "2019-06-07 00:24:14.962071"], ["updated_at", "2019-06-07 00:24:14.962071"]]
---
  def create
    @album = Album.new(album_params)

    if @album.save