app/controllers/application_controller.rb

  def current_user
    # If @current_user does not exist, check the user by session_token
    @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "CYO07OQZ7B_lYHTtzsv5rQ"], ["LIMIT", 1]]