app/controllers/bands_controller.rb

  def update
    @band = Band.find(params[:id])
    if @band.update(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Metallica5"], ["updated_at", "2019-06-06 21:08:53.484976"], ["id", 5]]