app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "joejoe"], ["LIMIT", 1]]
---
  def self.find_by_credentials(email, password)
    # first, find if any users exists in our DB with the provided email.
    user = User.find_by(email: email)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "oPuOz6fdrlQQln-GKZHwjQ"], ["updated_at", "2019-06-06 23:48:06.723825"], ["id", 1]]
---
  def reset_session_token!
    # assigning a new session token
    self.session_token = User.generate_session_token

    # save the user with the new session token
    self.save!